#Область ПрограммныйИнтерфейс  

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 

	ИначеЕсли ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаСписка" Тогда
		ВставитьПолеКонтактноеЛицоВФормуСписка(Форма)	
	КонецЕсли;
	
	

КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс 

Процедура ВставитьПолеКонтактноеЛицоВФормуСписка(Форма) Экспорт 
	
	ПолеВвода = Форма.Элементы.Вставить("ап_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.Список, Форма.Элементы.Договор); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеВвода.ПутьКДанным = "Объект.ап_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма) Экспорт
	
	ПолеВвода = Форма.Элементы.Добавить("ап_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ап_КонтактноеЛицо"
	
КонецПроцедуры  




	
#КонецОбласти
